
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр _СостояниеКарточек
	Движения._СостояниеКарточек.Записывать = Истина;
	Для Каждого ТекСтрокаРеквизиты Из Реквизиты Цикл
		Движение = Движения._СостояниеКарточек.Добавить();
		Движение.Период = Дата;
		Движение.ВидРеквизита = ТекСтрокаРеквизиты.ВидРеквизита;
		Движение.Карточка = Карточка;
		Движение.УИД_Элемента = ТекСтрокаРеквизиты.УИД_Элемента;
		Движение.ЗначениеРеквизита = ТекСтрокаРеквизиты.ЗначениеРеквизита;
		Движение.ЗначениеАктивно = Истина;
	КонецЦикла;
КонецПроцедуры
