
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Владелец_Форма = Неопределено;
	Владелец_Список = Неопределено;
	Владелец_Поле = Неопределено;
	_НаКлиенте.ОпределитьВладельцаФормы(ЭтаФорма.ВладелецФормы,Владелец_Форма,Владелец_Список,Владелец_Поле);
	
	Если 
	   ( Владелец_Форма <> Неопределено И Владелец_Форма.ИмяФормы = "Справочник._Карточки.Форма.ФормаЭлемента"
	   И Владелец_Список <> Неопределено И Владелец_Список.Имя = "Реквизиты" 
	   )
	Тогда
		ФункциональнаяРоль =  Владелец_Форма[Владелец_Список.Имя].ТекущиеДанные.ФункциональнаяРоль;
		ЭтаФорма.Отбор_ВидКарточки = _ВызовСервера.ПолучитьЗначение(ФункциональнаяРоль,"ВидКарточки");
		
		// Здесь нужно установить отбор в Динамическом списке "Список". по полю ВидыКарточки.Вид карточки, значение отбора хранится в ЭтаФорма.Отбор_ВидКарточки.
	КонецЕсли;
КонецПроцедуры
