Процедура ОпределитьВладельцаФормы(ВладелецФормы,Владелец_Форма=Неопределено,Владелец_Список = Неопределено,Владелец_Поле = Неопределено) Экспорт
	//Определяет форму из которой была открыта текущая форма.
	Если ВладелецФормы <> Неопределено
		И (	
		ТипЗнч(ВладелецФормы) = Тип("ТаблицаФормы")	
		ИЛИ ТипЗнч(ВладелецФормы) = Тип("ПолеФормы")
		ИЛИ ТипЗнч(ВладелецФормы) = Тип("ФормаКлиентскогоПриложения")
		)
		Тогда
		////Владелец_Форма = ЭтаФорма.ВладелецФормы.Родитель.Родитель.Родитель....;
		ВладелецВИтерации = ВладелецФормы;
		
		ЗащитаИтерации = 20;
		Пока ЗащитаИтерации>0 Цикл
			Если ТипЗнч(ВладелецВИтерации)=Тип("ПолеФормы") Тогда 
				Владелец_Поле = ВладелецВИтерации;	
			ИначеЕсли ТипЗнч(ВладелецВИтерации)=Тип("ТаблицаФормы") Тогда 
				Владелец_Список = ВладелецВИтерации;	
			ИначеЕсли ТипЗнч(ВладелецВИтерации)=Тип("ФормаКлиентскогоПриложения") Тогда 
				Владелец_Форма = ВладелецВИтерации;
				Прервать;
			КонецЕсли;
			ВладелецВИтерации = ВладелецВИтерации.Родитель;
			ЗащитаИтерации = ЗащитаИтерации - 1;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция КонвертироватьВСтруктуру(ДанныеДляКонвертации, Знач ИменаКолонок = Неопределено) Экспорт
	// 1. Вычисляю структуру результата
	Если ТипЗнч(ИменаКолонок) = Тип("Строка") И ЗначениеЗаполнено(ИменаКолонок) Тогда
		СтркутураРезультата = ИменаКолонок; 
	Иначе 
		Возврат Новый Структура;
	КонецЕсли;
	
    // 2. Создаю пустую структуру с нужными ключами
    Результат = Новый Структура(СтркутураРезультата);
    
    // 3. Заполняю результат из данных конвертации
	Если ТипЗнч(ДанныеДляКонвертации) = Тип("ДанныеФормыКоллекция") 
	 ИЛИ ТипЗнч(ДанныеДляКонвертации) = Тип("ДанныеФормыЭлементДерева") Тогда
		ЗаполнитьЗначенияСвойств(Результат, ДанныеДляКонвертации);
	КонецЕсли;
    
    Возврат Результат;
КонецФункции

