Процедура ОпределитьВладельцаФормы(ВладелецФормы,Владелец_Форма=Неопределено,Владелец_Список = Неопределено,Владелец_Поле = Неопределено) Экспорт
	//Определяет форму из которой была открыта текущая форма.
	Если ВладелецФормы <> Неопределено
		И (	
		ТипЗнч(ВладелецФормы) = Тип("ТаблицаФормы")	
		ИЛИ ТипЗнч(ВладелецФормы) = Тип("ПолеФормы")
		ИЛИ ТипЗнч(ВладелецФормы) = Тип("ФормаКлиентскогоПриложения")
		)
		Тогда
		////Владелец_Форма = ЭтаФорма.ВладелецФормы.Родитель.Родитель.Родитель....;
		ВладелецВИтерации = ВладелецФормы;
		
		ЗащитаИтерации = 20;
		Пока ЗащитаИтерации>0 Цикл
			Если ТипЗнч(ВладелецВИтерации)=Тип("ПолеФормы") Тогда 
				Владелец_Поле = ВладелецВИтерации;	
			ИначеЕсли ТипЗнч(ВладелецВИтерации)=Тип("ТаблицаФормы") Тогда 
				Владелец_Список = ВладелецВИтерации;	
			ИначеЕсли ТипЗнч(ВладелецВИтерации)=Тип("ФормаКлиентскогоПриложения") Тогда 
				Владелец_Форма = ВладелецВИтерации;
				Прервать;
			КонецЕсли;
			ВладелецВИтерации = ВладелецВИтерации.Родитель;
			ЗащитаИтерации = ЗащитаИтерации - 1;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры