
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры

&НаСервере
Процедура ТипЗначения_ПВХПриИзмененииНаСервере()
	Объект.ТипЗначения = Объект.ТипЗначения_ПВХ.ТипЗначения;
	
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ТипЗначения_ПВХПриИзменении(Элемент)
	ТипЗначения_ПВХПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимость()
	ЭтаФорма.Элементы.ВидКарточки.Доступность = (Объект.ТипЗначения_ПВХ = ПланыВидовХарактеристик._ТипыЗначений.Карточка);
КонецПроцедуры
