
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Истина = ЭтаФорма.Заголовок Тогда
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Владелец_Форма = Неопределено;
	Владелец_Список = Неопределено;
	Владелец_Поле = Неопределено;
	_НаКлиенте.ОпределитьВладельцаФормы(ЭтаФорма.ВладелецФормы,Владелец_Форма,Владелец_Список,Владелец_Поле);
	
	Если 
	   ( Владелец_Форма <> Неопределено И Владелец_Форма.ИмяФормы = "Справочник._ВидыКарточек.Форма.ФормаЭлемента"
	   И Владелец_Список <> Неопределено И Владелец_Список.Имя = "ИсточникиФункциональныхРолей" 
	   И Владелец_Форма[Владелец_Список.Имя].Параметры.Элементы.Количество() > 0
	   )
	ИЛИ   
	   ( Владелец_Форма <> Неопределено И Владелец_Форма.ИмяФормы = "Справочник._Команды.Форма.ФормаЭлемента"
	   И Владелец_Список <> Неопределено И Владелец_Список.Имя = "ИсточникиФункциональныхРолей" 
	   И Владелец_Форма[Владелец_Список.Имя].Параметры.Элементы.Количество() > 0
	   )
	Тогда
		Для Каждого ПараметрОтбора из Владелец_Форма[Владелец_Список.Имя].Параметры.Элементы Цикл
		    ИмяПараметра = ""+ПараметрОтбора.Параметр;
			Если ИмяПараметра = "ВидКарточки"
			 ИЛИ ИмяПараметра = "Команда" 
			Тогда
				ЭтаФорма.Запись[ИмяПараметра] = ПараметрОтбора.Значение;
				ЭтаФорма.Элементы[ИмяПараметра].ТолькоПросмотр = Истина;
			КонецЕсли;
		КонецЦикла;
		Если Владелец_Форма <> Неопределено И Владелец_Форма.ИмяФормы = "Справочник._ВидыКарточек.Форма.ФормаЭлемента" Тогда
			ЭтаФорма.Запись["Команда"] = Владелец_Форма.Элементы.Команды.ТекущиеДанные.Команда;
		КонецЕсли;
		Если Владелец_Форма <> Неопределено И Владелец_Форма.ИмяФормы = "Справочник._Команды.Форма.ФормаЭлемента" Тогда
			БазоваяФункциональнаяРоль = ПредопределенноеЗначение("Справочник._ФункциональныеРоли.ОсновнаяФР");
			Для каждого ИндефикаторВыделеннойСтроки ИЗ Владелец_Форма.Элементы.ФункциональныеРоли.ВыделенныеСтроки Цикл
				ВыделеннаяСтрока = Владелец_Форма.Элементы.ФункциональныеРоли.ДанныеСтроки(ИндефикаторВыделеннойСтроки);
				Если ВыделеннаяСтрока.ФункциональнаяРоль = БазоваяФункциональнаяРоль Тогда
					ЭтаФорма.Запись["ВидКарточки"] = ВыделеннаяСтрока.ВидКарточки;
				Иначе
					ЭтаФорма.Запись["ФункциональнаяРоль"] = ВыделеннаяСтрока.ФункциональнаяРоль;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры
