//Модуль для работы с JSON v1.01.21 - 2021.11.24


#Область Константы
Функция СпособыЧтения() Экспорт
	Р = Новый Структура();
	Р.Вставить("ВСтруктуру",1);
	Р.Вставить("ВМассив",2);
	Р.Вставить("ВТаблицуЗначений",3);
	Р.Вставить("ВСоответствие",4);
	Р.Вставить("ВСоответствие_ПустоВИстину",5);
	Р.Вставить("ВСоответствие_ПустоВЛожь",6);
	Возврат Р;
КонецФункции
#Конецобласти


#Область ПрочитатьJSON 
Функция Прочитать(JSON_Текстом,СпособЧтенияИлиНазначение=Неопределено,ИспользоватьПопыткуПриВосстановленииЗначений = Ложь) Экспорт
	//в реквизите СпособЧтенияИлиНазначение могут быть указаны:
	//   - СпособЧтения - результ функции JSON.СпособыЧтения()
	//   - Назначение - Массив либо Таблицеподобный объет, который д.б. дополнен
	
	СПОСОБЫ_ЧТЕНИЯ = СпособыЧтения();

	Если СпособЧтенияИлиНазначение = СПОСОБЫ_ЧТЕНИЯ.ВМассив Тогда
		Результат = Новый Массив;
		СпособЧтения = СПОСОБЫ_ЧТЕНИЯ.ВМассив
	ИначеЕсли СпособЧтенияИлиНазначение = СПОСОБЫ_ЧТЕНИЯ.ВСоответствие 
	ИЛИ СпособЧтенияИлиНазначение = СПОСОБЫ_ЧТЕНИЯ.ВСоответствие_ПустоВИстину
	ИЛИ СпособЧтенияИлиНазначение = СПОСОБЫ_ЧТЕНИЯ.ВСоответствие_ПустоВЛожь
	Тогда
		Результат = Новый Соответствие;
		СпособЧтения = СПОСОБЫ_ЧТЕНИЯ.ВСоответствие;
		Если СпособЧтенияИлиНазначение = СПОСОБЫ_ЧТЕНИЯ.ВСоответствие_ПустоВИстину Тогда
			ЗначениеДляЗаменыПусто=Истина;
		ИначеЕсли СпособЧтенияИлиНазначение = СПОСОБЫ_ЧТЕНИЯ.ВСоответствие_ПустоВЛожь Тогда
			ЗначениеДляЗаменыПусто=Ложь;
		Иначе
			ЗначениеДляЗаменыПусто=Неопределено;
		КонецЕсли;	
	#Если Сервер Тогда
	//Согласно https://its.1c.ru/db/v8std#content:439:hdoc не рекомендуется делать разрыв блока "Если" командами препроцессора
	//ТаблицаЗначений не работает на клиенте		
	ИначеЕсли СпособЧтенияИлиНазначение = СПОСОБЫ_ЧТЕНИЯ.ВТаблицуЗначений Тогда
		Результат = Новый ТаблицаЗначений;
		СпособЧтения = СПОСОБЫ_ЧТЕНИЯ.ВТаблицуЗначений
		
	#КонецЕсли
	ИначеЕсли ТипЗнч(СпособЧтенияИлиНазначение) = тип("Массив") 
	Тогда
		Результат = СпособЧтенияИлиНазначение;
		СпособЧтения = СПОСОБЫ_ЧТЕНИЯ.ВМассив
	#Если Сервер Тогда 
	ИначеЕсли ТипЗнч(СпособЧтенияИлиНазначение) = тип("ТаблицаЗначений") Тогда
		Результат = СпособЧтенияИлиНазначение;
		СпособЧтения = СПОСОБЫ_ЧТЕНИЯ.ВТаблицуЗначений
	#КонецЕсли
	ИначеЕсли ТипЗнч(СпособЧтенияИлиНазначение) = тип("ДанныеФормыКоллекция") Тогда
		Результат = СпособЧтенияИлиНазначение;
		СпособЧтения = СПОСОБЫ_ЧТЕНИЯ.ВТаблицуЗначений

	//Иначе //Если СпособЧтения = СПОСОБЫ_ЧТЕНИЯ.ВСтруктуру Тогда
	//	Результат = Новый Структура();
	Иначе //Если СпособЧтения = СПОСОБЫ_ЧТЕНИЯ.ВСтруктуру Тогда
		Результат = Неопределено;
		СпособЧтения = СПОСОБЫ_ЧТЕНИЯ.ВСтруктуру
	КонецЕсли;	
			
	Если JSON_Текстом=Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(JSON_Текстом);
	РезультатПредварительный = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	
	ВосстановитьУпакованныеЗначения(РезультатПредварительный,ИспользоватьПопыткуПриВосстановленииЗначений);
	
	Если Результат = Неопределено
	ИЛИ СпособЧтенияИлиНазначение = Неопределено
	ИЛИ СпособЧтенияИлиНазначение = СПОСОБЫ_ЧТЕНИЯ.ВМассив
	ИЛИ СпособЧтенияИлиНазначение = СПОСОБЫ_ЧТЕНИЯ.ВСтруктуру
	Тогда
		//Нет необходимости модифицировать Результат
		Результат = РезультатПредварительный;
	ИначеЕсли СпособЧтения = СПОСОБЫ_ЧТЕНИЯ.ВСоответствие Тогда
		Для Каждого эл ИЗ РезультатПредварительный Цикл
			Если НЕ ПустаяСтрока(стрЗаменить(эл.Ключ,"""","")) Тогда
				Результат.Вставить(эл.Ключ,?(эл.Значение=Неопределено,ЗначениеДляЗаменыПусто,эл.Значение));
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(Результат) = Тип("Массив") И ТипЗнч(РезультатПредварительный) = Тип("Массив") И РезультатПредварительный.Количество()>0 Тогда
		Для Каждого ПереносимыйЭлементМассива ИЗ РезультатПредварительный Цикл
			Результат.Добавить(ПереносимыйЭлементМассива);
		КонецЦикла;
	ИначеЕсли ТипЗнч(РезультатПредварительный) = Тип("Массив") 
	И Результат<>Неопределено 
	И СпособЧтения = СПОСОБЫ_ЧТЕНИЯ.ВТаблицуЗначений 
	Тогда
			//указан объект назначения, в который требуется добавить данные
	//	Если ТипЗнч(Результат) = Тип("Массив") И Результат.Количество()>0 Тогда
	//		#Если Сервер Тогда 
	//		РезультатМодифицированный = Новый ТаблицаЗначений;
	//		Для Каждого КлючЗначения ИЗ Результат[0] Цикл
	//			РезультатМодифицированный.Колонки.Добавить(КлючЗначения.Ключ);
	//		КонецЦикла;
			Для Каждого строкаВМассиве ИЗ РезультатПредварительный Цикл
				НоваяСтрока = Результат.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,строкаВМассиве);
			КонецЦикла;
	//		Результат = РезультатМодифицированный; 
	//		#КонецЕсли
	//	КонецЕсли;
		
	Иначе
		//Не понятно как нужно модифицировать Результат
		Результат = РезультатПредварительный;
	КонецЕсли;	
	
	Возврат Результат;
	
	//----------------------------
	//ВОЗВРАТ !!!
	//----------------------------
	JSON_Текстом = СокрЛП(JSON_Текстом);
	ТипЧитаемогоJSON = "Массив";
	Если Лев(JSON_Текстом,1) ="[" Тогда // И Прав(JSON_Текстом,1) ="]"
		ТипЧитаемогоJSON = "[]";
		Результат = Новый Массив;
	ИначеЕсли  Лев(JSON_Текстом,1) ="{" Тогда //И Прав(JSON_Текстом,1) ="}"
		ТипЧитаемогоJSON = "{}";
		Результат = Новый Структура();
	ИначеЕсли  ЭтоЦифра(Лев(JSON_Текстом,1)) Тогда //И Прав(JSON_Текстом,1) ="}"
		ТипЧитаемогоJSON = "9";
		Результат = Новый Структура();
	Иначе
		Возврат Неопределено ;
	КонецЕсли;
	JSON_Текстом = Сред(JSON_Текстом,2);
	
КонецФункции

Функция ВосстановитьУпакованныеЗначения(ПредварительноПрочитанныйJSON,ИспользоватьПопыткуПриВосстановленииЗначений)
	Если ТипЗнч(ПредварительноПрочитанныйJSON) = тип("Структура") Тогда 
		Для каждого Элемент Из ПредварительноПрочитанныйJSON Цикл
			Если ТипЗнч(Элемент.Значение) = Тип("Строка") и Сред(Элемент.Значение,1,1) = "®" Тогда
				ВосстанавливоемоеЗначение = Сред(Элемент.Значение,2);
				Если  СтрДлина(ВосстанавливоемоеЗначение) =19
					И Сред(ВосстанавливоемоеЗначение,3,1)="."
					И Сред(ВосстанавливоемоеЗначение,6,1)="."
					И Сред(ВосстанавливоемоеЗначение,11,1)=" "
					И Сред(ВосстанавливоемоеЗначение,14,1)=":"
					И Сред(ВосстанавливоемоеЗначение,17,1)=":"
				Тогда // Это дата формата "01.01.2021 00:00:00", хорошо бы ещё было циферки проверить
					ПредварительноПрочитанныйJSON[Элемент.Ключ] = Дата(ВосстанавливоемоеЗначение);
				Иначе
					Если ИспользоватьПопыткуПриВосстановленииЗначений Тогда
						Попытка
							ПредварительноПрочитанныйJSON[Элемент.Ключ] = api_ВызовСервера.ПолучитьЗначение(ВосстанавливоемоеЗначение);
						Исключение
						КонецПопытки;
					Иначе
						ПредварительноПрочитанныйJSON[Элемент.Ключ] = api_ВызовСервера.ПолучитьЗначение(ВосстанавливоемоеЗначение);
					КонецЕсли;
				КонецЕсли;
			ИначеЕсли ТипЗнч(Элемент.Значение) = тип("Структура") Тогда
				ВосстановитьУпакованныеЗначения(Элемент.Значение,ИспользоватьПопыткуПриВосстановленииЗначений);	
			ИначеЕсли ТипЗнч(Элемент.Значение) = тип("Массив") Тогда
				ВосстановитьУпакованныеЗначения(ПредварительноПрочитанныйJSON[Элемент.Ключ],ИспользоватьПопыткуПриВосстановленииЗначений)
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли ТипЗнч(ПредварительноПрочитанныйJSON) = тип("Массив") Тогда
		Для каждого ЭлементМассива из ПредварительноПрочитанныйJSON Цикл
			ВосстановитьУпакованныеЗначения(ЭлементМассива,ИспользоватьПопыткуПриВосстановленииЗначений);	
		КонецЦикла;
    КонецЕсли;
	Возврат ПредварительноПрочитанныйJSON;
КонецФункции
#Конецобласти

#Область CоздатьJSON 
Функция Cоздать(ДанныеДляПревращенияВJSON) Экспорт
	DoubleQuote="""";
	Тип_ДанныеДляПревращенияВJSON = ТипЗнч(ДанныеДляПревращенияВJSON);
	
	Если Тип_ДанныеДляПревращенияВJSON = Тип("Структура")
		ИЛИ Тип_ДанныеДляПревращенияВJSON = Тип("ФиксированнаяСтруктура")
		ИЛИ Тип_ДанныеДляПревращенияВJSON = Тип("Соответствие")
		ИЛИ Тип_ДанныеДляПревращенияВJSON = Тип("ФиксированноеСоответствие")
	Тогда
		Результат="";
		Разделитель = "";
		Для каждого КлючЗначение Из ДанныеДляПревращенияВJSON Цикл
			ЭлементJSON = """"+ КлючЗначение.Ключ+""":"+Cоздать(КлючЗначение.Значение);
			Результат = Результат+Разделитель+ЭлементJSON;
			Разделитель = ",";
		КонецЦикла;
		Результат="{"+Результат+"}";
	ИначеЕсли Тип_ДанныеДляПревращенияВJSON = Тип("РезультатЗапроса")
	Тогда
		Результат=Cоздать(ДанныеДляПревращенияВJSON.Выгрузить());
	ИначеЕсли Тип_ДанныеДляПревращенияВJSON = Тип("СтрокаТаблицыЗначений") Тогда
		Результат="";
		Разделитель = "";
		Колонки = ДанныеДляПревращенияВJSON.Владелец().Колонки;
		Для каждого Колонка Из Колонки Цикл
			ЭлементJSON = """" + Колонка.Имя + """:" + Cоздать(ДанныеДляПревращенияВJSON[Колонка.Имя]);
			Результат = Результат+Разделитель+ЭлементJSON;
			Разделитель = ",";
		КонецЦикла;
		Результат="{"+Результат+"}";
			
	ИначеЕсли Тип_ДанныеДляПревращенияВJSON = Тип("Массив")
		ИЛИ Тип_ДанныеДляПревращенияВJSON = Тип("ТаблицаЗначений")
	Тогда
		Результат="";
		Разделитель = "";
		Для каждого элМассива Из ДанныеДляПревращенияВJSON Цикл
			ЭлементJSON = Cоздать(элМассива);			
			Результат = Результат+Разделитель+ЭлементJSON;
			Разделитель = ",";
		КонецЦикла;
		Результат="["+Результат+"]";
			
	ИначеЕсли Тип_ДанныеДляПревращенияВJSON = Тип("ДеревоЗначений")
		ИЛИ Тип_ДанныеДляПревращенияВJSON = Тип("СтрокаДереваЗначений")
	Тогда
		Результат="";
		Для Каждого тСтр Из ДанныеДляПревращенияВJSON.Строки Цикл
			ЭлементJSON = "{"
			+"""Код"":"""+тСтр.Код+""","
			+"""Представление"":"""+тСтр.АльтернативноеНаименование+""","
			+"""Значение"":"+?(тСтр.ЗначениеБулево="Да",1,0)+","
			+"""Ветви"":"+Cоздать(тСтр)
			+"}";
			Результат=Результат+?(ПустаяСтрока(Результат),"",",")+ЭлементJSON;
		КонецЦикла;
		Результат="["+Результат+"]";
		Возврат Результат;
	ИначеЕсли Тип_ДанныеДляПревращенияВJSON = Тип("Строка") Тогда
		РабочаяСтрока = СокрЛП(ДанныеДляПревращенияВJSON);
		Если Лев(РабочаяСтрока,1) = "{" И Прав(РабочаяСтрока,1) = "}" Тогда
	    	Результат = РабочаяСтрока;
		Иначе
	    	Результат = """"+ЭкранироватьСпецСимволы(РабочаяСтрока)+"""";
		КонецЕсли;
	ИначеЕсли Тип_ДанныеДляПревращенияВJSON = Тип("Число") Тогда
		//+Высоких, 2021-09-07 представление 0 сделал "0", иначе значение 0 передавалось в формат как ""
		Результат = СокрЛП(Формат(ДанныеДляПревращенияВJSON,"ЧРД=.; ЧН=0; ЧГ=0"));
	ИначеЕсли Тип_ДанныеДляПревращенияВJSON = Тип("Булево") Тогда
		Результат = ?(ДанныеДляПревращенияВJSON,"true","false"); //JSON проглатывает логический тип
	ИначеЕсли Тип_ДанныеДляПревращенияВJSON = Тип("Дата") Тогда
		//Что бы дата могла обратно конвертироваться 1С
		Если ДанныеДляПревращенияВJSON = Дата(1,1,1) Тогда
			Результат = """®"+"01.01.0001 00:00:00"+"""";
		Иначе
			Результат = """®"+СокрЛП(Формат(ДанныеДляПревращенияВJSON,"ДФ='dd.MM.yyyy HH:mm:ss'"))+"""";
		КонецЕсли;
		//Результат = """"+СокрЛП(XMLСтрока(ДанныеДляПревращенияВJSON)+"""");
		//Результат = """"+ДанныеДляПревращенияВJSON+"""";
	ИначеЕсли Метаданные.НайтиПоТипу(Тип_ДанныеДляПревращенияВJSON)<>Неопределено Тогда //Это объектный тип
		ОбъектМетаданных = Метаданные.НайтиПоТипу(Тип_ДанныеДляПревращенияВJSON);
		Если Метаданные.Перечисления.Содержит(ОбъектМетаданных) Тогда
			ПриведённоеЗначение = XMLСтрока(ДанныеДляПревращенияВJSON);
			Если ПустаяСтрока(ПриведённоеЗначение) Тогда
				ПриведённоеЗначение = "ПустаяСсылка()";
			КонецЕсли;
			Результат = """®Перечисления."+ДанныеДляПревращенияВJSON.Метаданные().Имя+"."+ПриведённоеЗначение+"""";
		ИначеЕсли 
			Метаданные.Справочники.Содержит(ОбъектМетаданных) 
			ИЛИ Метаданные.Документы.Содержит(ОбъектМетаданных) 
			ИЛИ Метаданные.Задачи.Содержит(ОбъектМетаданных) 
		Тогда
			Результат = """®"+ПолучитьНавигационнуюСсылку(ДанныеДляПревращенияВJSON)+"""";
		Иначе
			Результат = """Фигня."+ДанныеДляПревращенияВJSON.Метаданные().Имя+"."+XMLСтрока(ДанныеДляПревращенияВJSON)+"""";
		КонецЕсли
	ИначеЕсли ДанныеДляПревращенияВJSON=Неопределено Тогда //Это объектный тип
			Результат = """®Неопределено""";
	ИначеЕсли ДанныеДляПревращенияВJSON=Null Тогда //Это объектный тип
			Результат = """®Null""";
	Иначе
	    Результат = """"+ДанныеДляПревращенияВJSON+"""";
		//Запись = Новый ЗаписьJSON;
		//Запись.УстановитьСтроку();
		//
		//ЗаписатьJSON(Запись, ДанныеДляПревращенияВJSON);
		//Результат = Запись.Закрыть();
		
		//Возврат СтрЗаменить(СтрЗаменить(Результат,Символы.ПС,""),Символы.ВК,"");
	КонецЕсли;
	
	Возврат Результат;	
КонецФункции
	
Функция ЭкранироватьСпецСимволы(СтрокаДляЭкранирования) Экспорт
	Результат = СтрокаДляЭкранирования;
	Результат = СтрЗаменить(Результат,"\","\\");
	Результат = СтрЗаменить(Результат,"""","\""");
	Результат = СтрЗаменить(Результат,Символ(65279),""); //Какая-то фигня в первом символе
	Возврат Результат;
КонецФункции

#Конецобласти

//// что-то, где-то писал регулярные выражения
Функция ЭтоЦифра(Символ) 
 КодСимвола = КодСимвола(Символ); 
 Возврат (КодСимвола >= 48 И КодСимвола <= 57) 
КонецФункции
	
// Функция преобразования в Дату
Функция ПреобразоватьВДату(ПреобразуемоеЗначение) Экспорт
	ТипЗначения = ТипЗнч(ПреобразуемоеЗначение);
	Если ТипЗначения = Тип("Дата") Тогда
		Возврат ПреобразуемоеЗначение;
	ИначеЕсли ТипЗначения = Тип("Строка") и ПустаяСтрока(ПреобразуемоеЗначение) Тогда //Пустая строка
		Возврат Дата("01.01.0001 "+"00:00:00");
	ИначеЕсли ТипЗначения = Тип("Строка") и СтрДлина(ПреобразуемоеЗначение) = 10+1+8 Тогда //"01.01.2021 00:00:00"
		Возврат Дата(ПреобразуемоеЗначение);
	ИначеЕсли ТипЗначения = Тип("Строка") и СтрДлина(ПреобразуемоеЗначение) = 10 Тогда //"01.01.2021"
		Возврат Дата(ПреобразуемоеЗначение+" 00:00:00");
	ИначеЕсли ТипЗначения = Тип("Строка") и СтрДлина(ПреобразуемоеЗначение) = 8 Тогда //"00:00:00"
		Возврат Дата("01.01.0001 "+ПреобразуемоеЗначение);
	КонецЕсли;
	
	Возврат ПреобразуемоеЗначение;
КонецФункции


#Область ИсторияВерсий 
// v1.01.21 - 2021.11.24
// Шерер
// 1. api_JSON.ПреобразоватьВДату(): исправил ошибки

// v1.01.20 - 2021.11.03
// Шерер
// 1. Функция ПреобразоватьВДату() исправил ошибки

// 2. Функция Создать(): исправил ошибку преобразования пустой даты  

// v1.01.19 - 2021.10.014
// Шерер
// Функция Создать(): исправл ошибку обработки пустого значения перечисления

// v1.01.18 - 2021.10.012
// Шерер

// v1.01.17 - 2021.10.05
// Шерер
// Функция Создать(): формат даты:

// v1.01.17 - 2021.10.05
// Шерер
// Функция Создать(): настроил обработку типов:
//  - Перечисления
//	- Дата
//	- Булево

// v1.01.16 - 2021.09.хх
//   номер пропущен

// v1.01.15 - 2021.09.07
// Процедура Создать: исправлено отображение ссылок в виде навигационной ссылки.
//		Результат = """"+ПолучитьНавигационнуюСсылку(ДанныеДляПревращенияВJSON)+"""";

// v1.01.13 - 2021.08.20
// Процедура Создать: исправлено отображение ссылок в виде навигационной ссылки.
//		Результат = ПолучитьНавигационнуюСсылку(ДанныеДляПревращенияВJSON)+"""";

//v1.01.12 - 2021.07.20
// Процедура Создать: добавлено форматирование числа для приведения его из вида 1 000 000,21 к виду 1000000.21
//	Результат = СокрЛП(Формат(ДанныеДляПревращенияВJSON,"ЧРД=.; ЧГ=0"));


//v1.01.10 - 2021.06.08
//процедура Создать: добавил обработку Тип_ДанныеДляПревращенияВJSON = Тип("РезультатЗапроса")
//процедура Создать: исправил ВидОбъектаМетаданных = "Задача"

//v1.01.09 - 2021.05.12
//процедура Создать: исправил ВидОбъектаМетаданных = "Справочник"/"Документ"

//v1.01.08 - 2021.04.14
//Добавил в Прочитать() СпособЧтенияИлиНазначение

//v1.01.07 - 2021.04.09
//Добавил в Прочитать() СпособЧтения

//v1.01.06 - 2021 03 03

//v1.01.05 - 2021.03.03
//Добавил в Создать() обработчики	ОбъектныхТипов Документ,Справочник

//v1.01.05 - 2021.02.04
//Добавил в Создать() обработчики	ФиксированнаяСтруктура, Соответствие, ФиксированноеСоответствие 

//v1.01.04 - 2021.01.27
//ЭкранироватьСпецСимволы(СтрокаДляЭкранирования) установил экспорт

//v1.01.03
//2021.01.20 - Добавил экраниранирование кавычек
#Конецобласти
