&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Владелец_Форма = Неопределено;
		Владелец_Список = Неопределено;
		Владелец_Поле = Неопределено;
		_НаКлиенте.ОпределитьВладельцаФормы(ЭтаФорма.ВладелецФормы,Владелец_Форма,Владелец_Список,Владелец_Поле);
		Если 
		   ( Владелец_Форма <> Неопределено И Владелец_Форма.ИмяФормы = "Справочник._Команды.Форма.ФормаЭлемента"
		   И Владелец_Список <> Неопределено И Владелец_Список.Имя = "ПравилаОбработкиКоманды" 
		   )
		Тогда
			Объект.Команда = Владелец_Форма.Объект.Ссылка;
			Объект.ВидКарточки = Владелец_Форма.Объект.ВидКарточки;
	    КонецЕсли;
    КонецЕсли;

	ОпределитьТипыЗначений();
КонецПроцедуры

&НаКлиенте
Процедура ДействияПриИзменении(Элемент)
	ОпределитьТипыЗначений();
КонецПроцедуры

&НаКлиенте
Процедура УсловияПриИзменении(Элемент)
	ОпределитьТипыЗначений();
КонецПроцедуры

&НаСервере
Процедура ОпределитьТипыЗначений()
	Для Каждого стрДействия ИЗ ЭтаФорма.Объект.Действия Цикл
		стрДействия.ТипЗначения = стрДействия.Действие.ТипЗначения;
		стрДействия.Действие_ИспользоватьФункциональнаяРоль = стрДействия.Действие.ИспользоватьФункциональнуюРоль;
		Если НЕ стрДействия.Действие.ИспользоватьФункциональнуюРоль Тогда
			стрДействия.Действие_ФункциональнаяРоль = Неопределено;	
		КонецЕсли;
	КонецЦикла;

	Для Каждого стрУсловия ИЗ ЭтаФорма.Объект.Условия Цикл
		Если ЗначениеЗаполнено(стрУсловия.ВидРеквизитаДополнение) Тогда
			стрУсловия.ТипЗначения = стрУсловия.ВидРеквизитаДополнение;
		Иначе	
			стрУсловия.ТипЗначения = стрУсловия.ВидРеквизита;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры



