&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Владелец_Форма = Неопределено;
		Владелец_Список = Неопределено;
		Владелец_Поле = Неопределено;
		_НаКлиенте.ОпределитьВладельцаФормы(ЭтаФорма.ВладелецФормы,Владелец_Форма,Владелец_Список,Владелец_Поле);
		Если 
		   ( Владелец_Форма <> Неопределено И Владелец_Форма.ИмяФормы = "Справочник._Команды.Форма.ФормаЭлемента"
		   И Владелец_Список <> Неопределено И Владелец_Список.Имя = "ПравилаОбработкиКоманды" 
		   )
		Тогда
			Объект.Команда = Владелец_Форма.Объект.Ссылка;
			Объект.ВидКарточки = Владелец_Форма.Объект.ВидКарточки;
	    КонецЕсли;
    КонецЕсли;

	ОпределитьТипыЗначений();
КонецПроцедуры

&НаКлиенте
Процедура ДействияПриИзменении(Элемент)
	ОпределитьТипыЗначений();
КонецПроцедуры

&НаКлиенте
Процедура УсловияПриИзменении(Элемент)
	ОпределитьТипыЗначений();
КонецПроцедуры

&НаСервере
Процедура ОпределитьТипыЗначений()
	Для Каждого стрДействия ИЗ ЭтаФорма.Объект.Действия Цикл
		
		стрДействия.ЭтоВидЗначения_Значение = Ложь;
		стрДействия.ЭтоВидЗначения_Функция = Ложь;
		стрДействия.ЭтоВидЗначения_ИзРеквизитаФункцРоли = Ложь;
		Если ЗначениеЗаполнено(стрДействия.Действие_ФункциональнаяРоль) Тогда
			стрДействия.ЭтоВидЗначения_ИзРеквизитаФункцРоли = Истина;
		ИначеЕсли ЗначениеЗаполнено(стрДействия.ФункцияПолученияЗначения) Тогда
			стрДействия.ЭтоВидЗначения_ИзРеквизитаФункцРоли = Истина;
		Иначе 
			стрДействия.ЭтоВидЗначения_Значение = Истина;
		КонецЕсли;
		
		стрДействия.ТипЗначения = стрДействия.Действие.ТипЗначения;
		
		стрДействия.Представление = "";
		//стрДействия.Представление = стрДействия.Представление+" "+стрДействия.ФункциональнаяРоль.Код+"["+стрДействия.ВидРеквизита+"]";
		стрДействия.Представление = стрДействия.Представление+" "+стрДействия.Действие;
		Если стрДействия.СпособВычисленияЗначения = ПредопределенноеЗначение("Перечисление._СпособыВычисленияЗначения.Функция") Тогда
			стрДействия.Представление = стрДействия.Представление+" "+стрДействия.ФункцияПолученияЗначения+"()";
		ИначеЕсли стрДействия.СпособВычисленияЗначения = ПредопределенноеЗначение("Перечисление._СпособыВычисленияЗначения.ИзРеквизитаФРоли") Тогда
			стрДействия.Представление = стрДействия.Представление+" "+стрДействия.Действие_ФункциональнаяРоль+"["+стрДействия.Действие_ВидРеквизита+"]";
		Иначе //Если ТекущиеДанные.СпособВычисленияЗначения = ПредопределенноеЗначение("Перечисление._СпособыВычисленияЗначения.Значение") Тогда
			стрДействия.Представление = стрДействия.Представление+" "+стрДействия.ЗначениеРеквизита;
		КонецЕсли;
		
	КонецЦикла;

	Для Каждого стрУсловия ИЗ ЭтаФорма.Объект.Условия Цикл
		Если ЗначениеЗаполнено(стрУсловия.ВидРеквизитаДополнение) Тогда
			стрУсловия.ТипЗначения = стрУсловия.ВидРеквизитаДополнение;
		Иначе	
			стрУсловия.ТипЗначения = стрУсловия.ВидРеквизита;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ДействияВидЗначенияПриИзменении(Элемент)
	ТекущиеДанные=ЭтаФорма.Элементы.Действия.ТекущиеДанные;
	
	Если Элемент.Имя="ДействияВидЗначения_Функция"	Тогда
		ТекущиеДанные.ЭтоВидЗначения_Значение = Ложь;
		ТекущиеДанные.ЭтоВидЗначения_Функция = ИСТИНА;
		ТекущиеДанные.ЭтоВидЗначения_ИзРеквизитаФункцРоли = Ложь;
		ТекущиеДанные.СпособВычисленияЗначения = ПредопределенноеЗначение("Перечисление._СпособыВычисленияЗначения.Функция");
	ИначеЕсли Элемент.Имя="ДействияВидЗначения_ИзРеквизитаФункцРоли"	Тогда
		ТекущиеДанные.ЭтоВидЗначения_Значение = Ложь;
		ТекущиеДанные.ЭтоВидЗначения_Функция = Ложь;
		ТекущиеДанные.ЭтоВидЗначения_ИзРеквизитаФункцРоли = ИСТИНА;
		ТекущиеДанные.СпособВычисленияЗначения = ПредопределенноеЗначение("Перечисление._СпособыВычисленияЗначения.ИзРеквизитаФРоли");
	Иначе //Если Элемент.Имя="ДействияВидЗначения"	Тогда
		ТекущиеДанные.ЭтоВидЗначения_Значение = ИСТИНА;
		ТекущиеДанные.ЭтоВидЗначения_Функция = Ложь;
		ТекущиеДанные.ЭтоВидЗначения_ИзРеквизитаФункцРоли = Ложь;
		ТекущиеДанные.СпособВычисленияЗначения = ПредопределенноеЗначение("Перечисление._СпособыВычисленияЗначения.Значение");
	КонецЕсли;
	
	Если ТекущиеДанные.ЭтоВидЗначения_Значение = Ложь	Тогда
		//ТекущиеДанные.ЗначениеРеквизита = Неопределено;
	КонецЕсли;
	Если ТекущиеДанные.ЭтоВидЗначения_Функция = Ложь	Тогда
		//ТекущиеДанные.ФункцияПолученияЗначения = Неопределено;
	КонецЕсли;
	Если ТекущиеДанные.ЭтоВидЗначения_ИзРеквизитаФункцРоли = Ложь	Тогда
		//ТекущиеДанные.Действие_ФункциональнаяРоль = Неопределено;
		//ТекущиеДанные.Действие_ВидРеквизита = Неопределено;
	КонецЕсли;

	ОбновитьДоступностьГруппыДействия();
КонецПроцедуры

&НаКлиенте
Процедура ДействияПриАктивизацииСтроки(Элемент)
	ОбновитьДоступностьГруппыДействия();
КонецПроцедуры 

&НаКлиенте
Процедура ОбновитьДоступностьГруппыДействия()
	ТекущиеДанные=ЭтаФорма.Элементы.Действия.ТекущиеДанные;
	
	Элементы.Группа_ДействиеЗначение.Доступность = ТекущиеДанные.ЭтоВидЗначения_Значение;
	Элементы.Группа_ДействиеФункция.Доступность = ТекущиеДанные.ЭтоВидЗначения_Функция;
	Элементы.Группа_ДействиеРеквизитФРоли.Доступность = ТекущиеДанные.ЭтоВидЗначения_ИзРеквизитаФункцРоли;
КонецПроцедуры


