&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОпределитьТипыЗначений();
КонецПроцедуры

&НаКлиенте
Процедура ДействияПриИзменении(Элемент)
	ОпределитьТипыЗначений();
КонецПроцедуры

&НаКлиенте
Процедура УсловияПриИзменении(Элемент)
	ОпределитьТипыЗначений();
КонецПроцедуры

&НаСервере
Процедура ОпределитьТипыЗначений()
	Для Каждого стрДействия ИЗ ЭтаФорма.Объект.Действия Цикл
		стрДействия.ТипЗначения = стрДействия.Действие.ТипЗначения;
		стрДействия.Действие_ИспользоватьФункциональнаяРоль = стрДействия.Действие.ИспользоватьФункциональнуюРоль;
		Если НЕ стрДействия.Действие.ИспользоватьФункциональнуюРоль Тогда
			стрДействия.Действие_ФункциональнаяРоль = Неопределено;	
		КонецЕсли;
	КонецЦикла;

	Для Каждого стрУсловия ИЗ ЭтаФорма.Объект.Условия Цикл
		Если ЗначениеЗаполнено(стрУсловия.ВидРеквизитаДополнение) Тогда
			стрУсловия.ТипЗначения = стрУсловия.ВидРеквизитаДополнение;
		Иначе	
			стрУсловия.ТипЗначения = стрУсловия.ВидРеквизита;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры



