&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОпределитьТипыЗначений();
КонецПроцедуры

&НаКлиенте
Процедура ДействияПриИзменении(Элемент)
	ОпределитьТипыЗначений();
КонецПроцедуры

&НаСервере
Процедура ОпределитьТипыЗначений()
	Для Каждого стрДействия ИЗ ЭтаФорма.Объект.Действия Цикл
		стрДействия.ТипЗначения = стрДействия.Действие.ТипЗначения;
		стрДействия.Действие_ИспользоватьФункциональнаяРоль = стрДействия.Действие.ИспользоватьФункциональнуюРоль;
		Если НЕ стрДействия.Действие.ИспользоватьФункциональнуюРоль Тогда
			стрДействия.Действие_ФункциональнаяРоль = Неопределено;	
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

