Функция ПолучитьДоступныеКоманды(Отбор,МенеджерВременныхТаблиц=Неопределено) Экспорт
	Возврат Справочники._Правила.ПолучитьДоступныеКоманды(Отбор,МенеджерВременныхТаблиц);
КонецФункции

Процедура ВыполнитьКоманду(Отказ,ОтборПоискаПравил) Экспорт
	//МассивОтборовДляИсполненияПравил = новый Массив;
	Если  ТипЗнч(ОтборПоискаПравил) =Тип("Структура")
		И ОтборПоискаПравил.Свойство("Карточки")
		И ОтборПоискаПравил.Свойство("Команды")
		И ТипЗнч(ОтборПоискаПравил.Команды) = Тип("Массив")
		И ОтборПоискаПравил.Команды.Количество() >= 1 
	Тогда
		//МассивОтборовДляИсполненияПравил.Добавить(Новый Структура("Команда,Карточка",Команда,Отбор.Карточка));
	Иначе
	    ВызватьИсключение "Параметр ""Отбор"" должен содержать заполненный массив ""Карточки"".";
		//Не умею
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	//
	//Для каждого ОтборДляИсполненияПравила из МассивОтборовДляИсполненияПравил Цикл
		СписокНайденныхПравил = Справочники._Правила.ПолучитьДоступныеПравила(ОтборПоискаПравил);
		Если СписокНайденныхПравил.Количество()=1 Тогда
			Если СписокНайденныхПравил[0].Обработчик = Перечисления._ОбработчикиПравил.СтандартнаяОбработка Тогда
				ОтборДляИсполненияПравила = Новый Структура("Команда,Карточка",ОтборПоискаПравил.Команды[0],ОтборПоискаПравил.Карточки[0].Карточки[0]);
				СтандартнаяОбработкаКоманды(Отказ,СписокНайденныхПравил[0],ОтборДляИсполненияПравила);
			Иначе
				//Не умею
				Отказ = Истина;
				Возврат;
			КонецЕсли;	
			
		Иначе
			//Не буду выполнять несколько правил по одной команде
			Отказ = Истина;
			ВызватьИсключение "Для выполнения команды найдено ноль или больше одного правила. Выполнение команды сброшено.";
			Возврат;
		КонецЕсли;
	//КонецЦикла;
КонецПроцедуры

Процедура СтандартнаяОбработкаКоманды(Отказ,Правило,ОтборДляПоискаПравил)
	
	//1. Получаю текущее сотояние
	Если ТипЗнч(ОтборДляПоискаПравил) =Тип("Структура") И ОтборДляПоискаПравил.Свойство("Карточка") Тогда
		ОтборДляЗапросаТекущегоСостояния = Новый Структура("Карточка",ОтборДляПоискаПравил.Карточка);
		ТекущееСостояниеМассивом = РегистрыСведений._СостояниеКарточек.ПолучитьСостояние(ОтборДляЗапросаТекущегоСостояния);
		ТекущееСостояние_Карточка_ВидРеквизита = новый Соответствие; // Запоминаю значения в разрезе Карточка_ВидРеквизита, т.к. планирую организовать сложное условие поиска правил, где будут указываться роли для карточек
		текКарточка ="НевозможноеЗначение";
		Для Каждого ТекущееСостояние_Элемент ИЗ ТекущееСостояниеМассивом Цикл
			Если текКарточка <> ТекущееСостояние_Элемент.Карточка Тогда
				текКарточка = ТекущееСостояние_Элемент.Карточка;
				ТекущееСостояние_Карточка_ВидРеквизита.Вставить(текКарточка,новый Соответствие);
				ТекущееСостояние_Карточки = ТекущееСостояние_Карточка_ВидРеквизита.Получить(текКарточка);
			КонецЕсли;	
			ТекущееСостояние_Карточки.Вставить(ТекущееСостояние_Элемент.ВидРеквизита,ТекущееСостояние_Элемент.ЗначениеРеквизита);
		КонецЦикла;
	Иначе
		//Не умею
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	//2. Вычисляю новые значения реквизитов
	тзДвижений = новый ТаблицаЗначений;
	тзДвижений.Колонки.Добавить("ВидРеквизита");
	тзДвижений.Колонки.Добавить("Карточка");
	тзДвижений.Колонки.Добавить("УИД_Элемента");
	тзДвижений.Колонки.Добавить("ЗначениеРеквизита");
	тзДвижений.Колонки.Добавить("ЗначениеАктивно");

	Для каждого СтрокаДействия ИЗ Правило.Действия Цикл
		ТекущееСостояние_Карточки = ТекущееСостояние_Карточка_ВидРеквизита.Получить(ОтборДляПоискаПравил.Карточка);
		ТекущееЗначениеРеквизита = ТекущееСостояние_Карточки.Получить(СтрокаДействия.ВидРеквизита);
		
		Отбор = Новый Структура ("ВидРеквизита,Карточка,УИД_Элемента");
		Отбор.Вставить("Карточка",ОтборДляПоискаПравил.Карточка);
		Отбор.Вставить("ВидРеквизита",СтрокаДействия.ВидРеквизита);
		Отбор.Вставить("УИД_Элемента","");
		НайденныеСтроки_тзДвижений = _КлиентСервер.НайтиСтрокиВТЗ(тзДвижений,Отбор);
		
		Если НайденныеСтроки_тзДвижений.Количество()>0 Тогда
			стрДвижение = НайденныеСтроки_тзДвижений[0];
		Иначе 
			стрДвижение = тзДвижений.Добавить();
		КонецЕсли;
		стрДвижение.Карточка = ОтборДляПоискаПравил.Карточка;
		стрДвижение.ВидРеквизита = СтрокаДействия.ВидРеквизита;
		стрДвижение.УИД_Элемента = "";
		

		Если СтрокаДействия.Действие=Справочники._Действия.Установить Тогда
			стрДвижение.ЗначениеРеквизита = СтрокаДействия.ЗначениеРеквизита;
			ТекущееСостояние_Карточки.Вставить(стрДвижение.ВидРеквизита,стрДвижение.ЗначениеРеквизита);
		ИначеЕсли СтрокаДействия.Действие=Справочники._Действия.Прибавить Тогда
			стрДвижение.ЗначениеРеквизита = ТекущееЗначениеРеквизита + СтрокаДействия.ЗначениеРеквизита;
			ТекущееСостояние_Карточки.Вставить(стрДвижение.ВидРеквизита,стрДвижение.ЗначениеРеквизита);
		ИначеЕсли СтрокаДействия.Действие=Справочники._Действия.Вычесть Тогда
			стрДвижение.ЗначениеРеквизита = ТекущееЗначениеРеквизита - СтрокаДействия.ЗначениеРеквизита;
			ТекущееСостояние_Карточки.Вставить(стрДвижение.ВидРеквизита,стрДвижение.ЗначениеРеквизита);
		ИначеЕсли СтрокаДействия.Действие=Справочники._Действия.Максимум Тогда
			стрДвижение.ЗначениеРеквизита = Макс(ТекущееЗначениеРеквизита, СтрокаДействия.ЗначениеРеквизита);
			ТекущееСостояние_Карточки.Вставить(стрДвижение.ВидРеквизита,стрДвижение.ЗначениеРеквизита);
		ИначеЕсли СтрокаДействия.Действие=Справочники._Действия.Минимум Тогда
			стрДвижение.ЗначениеРеквизита = Мин(ТекущееЗначениеРеквизита, СтрокаДействия.ЗначениеРеквизита);
			ТекущееСостояние_Карточки.Вставить(стрДвижение.ВидРеквизита,стрДвижение.ЗначениеРеквизита);
		КонецЕсли;
	КонецЦикла;
	
	//3. запоминаю вычесленные значения реквизитов
	ДокументДвижения = Документы._ДвиженияКарточки.СоздатьДокумент();
	ДокументДвижения.Дата = ТекущаяДатаСеанса();
	Для каждого стрДвижение ИЗ тзДвижений Цикл
		Движение = ДокументДвижения.Движения._СостояниеКарточек.Добавить();
		Движение.Период = ДокументДвижения.Дата;
		Движение.Карточка = стрДвижение.Карточка;
		Движение.ВидРеквизита = стрДвижение.ВидРеквизита;
		Движение.УИД_Элемента = Неопределено; // Нужно решить вопрос со списочными видами реквизитов
		Движение.ЗначениеРеквизита = стрДвижение.ЗначениеРеквизита;
		Движение.ЗначениеАктивно = ИСТИНА;
	КонецЦикла;
	
	//ДокументДвижения = Документы._ДвиженияКарточки.СоздатьДокумент();
	//ДокументДвижения.Дата = ТекущаяДатаСеанса();
	//Для каждого СтрокаДействия ИЗ Правило.Действия Цикл
	//	ТекущееСостояние_Карточки = ТекущееСостояние_Карточка_ВидРеквизита.Получить(ОтборДляПоискаПравил.Карточка);
	//	ТекущееЗначениеРеквизита = ТекущееСостояние_Карточки.Получить(СтрокаДействия.ВидРеквизита);
	//	Если СтрокаДействия.Действие=Справочники._Действия.Установить Тогда
	//		Движение = ДокументДвижения.Движения._СостояниеКарточек.Добавить();
	//		Движение.Период = ДокументДвижения.Дата;
	//		Движение.Карточка = ОтборДляПоискаПравил.Карточка;
	//		Движение.ВидРеквизита = СтрокаДействия.ВидРеквизита;
	//		Движение.ЗначениеРеквизита = СтрокаДействия.ЗначениеРеквизита;
	//	КонецЕсли;
	//КонецЦикла;
	//ДокументДвижения.Движения.Записать();
	ДокументДвижения.Записать(РежимЗаписиДокумента.Проведение);
КонецПроцедуры
