Процедура ВыполнениеРегламентныхКоманд() Экспорт
	//ЗаписьЖурналаРегистрации("ОтладкаРЗ_Раширение", УровеньЖурналаРегистрации.Информация, , , "Регламентное задание выполнено!");
	й=1;

	//1.Получить, команды у которых АвтоОбработка=Истина, также получить количество строк в табличной части ФункциональныеРоли
	//2.Обработать команды в цикле
	//2.1 для тех команд, у которых количество ФункциональныхРолей = 0 выполнить
	//	Справочники._Команды.ВыполнитьКоманду()  
	//  Отбор по карточкам не устанавливать, карточки найдутся самостоятельно
	//2.2 для тех команд, у котрых количество ФункциональныхРолей > 0
	//2.2.1 Получить список карточек, где АвтоОбработка=Истина(АвтоОбработка - это предопределённый вид реквизита)
	//      Получать список нужно с помощью метода РегистрыСведений._СостояниеКарточек.ПолучитьСостояние()
	//2.2.2 Для каждой карточки получить функциональныые роли (см Справочник._Карточки.формаЭлемента)
	//2.2.3 выполнить команду Справочники._Команды.ВыполнитьКоманду()	
		
КонецПроцедуры