&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Инициализация реквизита формы для хранения добавленных команд и кнопок
	// Используем ТаблицуЗначений, так как Соответствие не поддерживается в реквизитах формы
	//Если ДобавленныеКоманды = Неопределено Тогда
	//	// Создаем таблицу значений с колонками для хранения информации
	//	ДобавленныеКоманды = Новый ТаблицаЗначений;
	//	ДобавленныеКоманды.Колонки.Добавить("ИмяКнопки");
	//	ДобавленныеКоманды.Колонки.Добавить("КодКоманды");
	//	ДобавленныеКоманды.Колонки.Добавить("Команда"); // Ссылка на элемент справочника _Команды
	//	ДобавленныеКоманды.Колонки.Добавить("Группа");  // Ссылка на элемент справочника _КомандыГруппы
	//	ДобавленныеКоманды.Колонки.Добавить("ИмяГруппыФормы"); // Имя группы на форме, в которой находится кнопка
	//КонецЕсли;
	
	// Заполнение табличной части "Реквизиты" текущими значениями
	Если ЗначениеЗаполнено(Объект.ВидКарточки) Тогда
		
		// Создаем отбор для получения текущих значений реквизитов
		Отбор = Новый Соответствие();
		Отбор.Вставить("ВидКарточки", Объект.ВидКарточки);
		Отбор.Вставить("Карточка", Объект.Ссылка);
		
		// Получаем текущие значения реквизитов
		Значения = РегистрыСведений._СостояниеКарточек.ПолучитьСостояние(Отбор);
		
		// Очищаем таблицу "Реквизиты" формы
		Реквизиты.Очистить();
		
		// Заполняем таблицу "Реквизиты" полученными значениями
		Для Каждого Эл Из Значения Цикл
			СтрРеквизиты = Реквизиты.Добавить();
			ЗаполнитьЗначенияСвойств(СтрРеквизиты, Эл);
		КонецЦикла;
		
	КонецЕсли;
	
	// Обновляем список доступных команд
	ОбновитьСписокКоманд();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокКоманд()
	// Удаляем ранее добавленные команды и группы
	УдалитьДобавленныеКоманды();
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Возврат; // не нужно заполнять команды для не сохранённой карточки
	КонецЕсли;
	
	// Получаем список доступных команд
	
	//Создаю массив карточек основной функциональной роли
	Массив_ФункциональнаяРоль_Основная = Новый Массив;
	Массив_ФункциональнаяРоль_Основная.Добавить(Объект.Ссылка);
	//Делаю полное описание основной функциональной роли
	Отбор_ФункциональнаяРоль_Основная = Новый Структура();
	Отбор_ФункциональнаяРоль_Основная.Вставить("ФункциональнаяРоль",Справочники._ФункциональныеРоли.ОсновнаяФР);
	Отбор_ФункциональнаяРоль_Основная.Вставить("Карточки",Массив_ФункциональнаяРоль_Основная);
	Отбор_ФункциональнаяРоль_Основная.Вставить("ПроверятьКакИ",Истина);
	//Подготавливаю масив проверяемых карточек в соответствии с их функциональными ролями	
	Отбор_Карточки = Новый Массив;
	Отбор_Карточки.Добавить(Отбор_ФункциональнаяРоль_Основная);
	Отбор = Новый Структура("Карточки,ВидКарточки",Отбор_Карточки,(Объект.Ссылка.ВидыКарточки[0].ВидКарточки));
	
	СписокКоманд = Справочники._Команды.ПолучитьДоступныеКоманды(Отбор);
	
	
	// Соответствие для отслеживания созданных групп команд
	// Ключ - ссылка на группу команды (_КомандыГруппы), Значение - имя группы на форме
	СозданныеГруппы = Новый Соответствие;
	
	// Проходим по списку доступных команд и создаем интерфейс
	Для Каждого ЭлементСписка Из СписокКоманд Цикл
		// Получаем саму ссылку на команду из структуры
		Команда = ЭлементСписка.Команда;
		// Получаем ссылку на группу команды из реквизита Группа справочника _Команды
		ГруппаКомандыСсылка = Команда.Группа;
		
		// Проверяем, что у команды установлена группа
		Если ЗначениеЗаполнено(ГруппаКомандыСсылка) Тогда
			
			// Проверяем, была ли уже создана группа для этой команды
			ИмяГруппыФормы = СозданныеГруппы.Получить(ГруппаКомандыСсылка);
			Если ИмяГруппыФормы = Неопределено Тогда
				
				// Формируем имя группы (подменю) для использования в интерфейсе формы
				// Используем уникальный идентификатор группы, заменив дефисы, чтобы избежать конфликта имен
				ИмяГруппыФормы = "ГруппаКоманд_" + СтрЗаменить(ГруппаКомандыСсылка.УникальныйИдентификатор(), "-", "");
				
				// Добавляем группу (подменю) в элементы формы (на командную панель)
				// Тип элемента - ГруппаФормы, Имя - уникальное, Родитель - заранее созданная группа на форме
				НоваяГруппа = Элементы.Добавить(ИмяГруппыФормы, Тип("ГруппаФормы"), Элементы.ГруппаКнопокКомандыДействий);
				// Устанавливаем заголовок группы равным наименованию группы команд
				НоваяГруппа.Заголовок = ГруппаКомандыСсылка.Наименование;
				
				// Сохраняем имя созданной группы в соответствии
				СозданныеГруппы.Вставить(ГруппаКомандыСсылка, ИмяГруппыФормы);
			КонецЕсли;
			
			// Формируем уникальное имя для команды кнопки
			КодКоманды = "Команда_" + СтрЗаменить(Команда.УникальныйИдентификатор(), "-", "") + "_" + СтрЗаменить(ГруппаКомандыСсылка.УникальныйИдентификатор(), "-", "");
			
			// Добавляем команду для кнопки в коллекцию команд формы
			НоваяКоманда = Команды.Добавить(КодКоманды);
			// Устанавливаем действие команды - вызов процедуры ОбработкаКомандыДействия
			// Это имя процедуры, которая будет выполнена при нажатии кнопки, связанной с командой
			НоваяКоманда.Действие = "ОбработкаКомандыДействия";
			
			// Уникальное имя для кнопки команды
			// Включает в себя часть от имени группы для уникальности
			ИмяКнопки = "Кнопка_" + СтрЗаменить(Команда.УникальныйИдентификатор(), "-", "") + "_" + СтрЗаменить(ГруппаКомандыСсылка.УникальныйИдентификатор(), "-", "");
			
			// Добавляем кнопку в элементы формы
			// Тип элемента - КнопкаФормы, Имя - уникальное, Родитель - группа команды
			НоваяКнопка = Элементы.Добавить(ИмяКнопки, Тип("КнопкаФормы"), НоваяГруппа);
			// Устанавливаем имя команды для кнопки (связь с командой меню)
			НоваяКнопка.ИмяКоманды = КодКоманды;
			// Устанавливаем заголовок кнопки равным наименованию команды
			НоваяКнопка.Заголовок = Команда.Наименование;
			
			// Сохраняем информацию о добавленной кнопке и связанной с ней команде в Таблице Значений
			НоваяСтрока = ДобавленныеКоманды.Добавить();
			НоваяСтрока.ИмяКнопки = ИмяКнопки;
			НоваяСтрока.КодКоманды=КодКоманды;
			НоваяСтрока.Команда = Команда;
			НоваяСтрока.Группа = ГруппаКомандыСсылка;
			НоваяСтрока.ИмяГруппыФормы = ИмяГруппыФормы;
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьДобавленныеКоманды()
	
	// Для корректного удаления пустых групп после кнопок,
	// запоминаем имена всех динамически добавленных групп.
	// Создадим соответствие для хранения уникальных имен групп.
	УникальныеИменаГрупп = Новый Соответствие;
	
	// Проходим по всем ранее добавленным командам и удаляем соответствующие элементы интерфейса
	// Используем итерацию с конца, чтобы избежать проблем с изменением исходной таблицы во время итерации
	
	// Получаем исходное количество строк
	ИсходноеКоличество = ДобавленныеКоманды.Количество();
	
	// Итерируемся от последней строки к первой (от большего индекса к меньшему)
	// Индексация строк в ТаблицеЗначений начинается с 0
	Для Счетчик = 0 По ИсходноеКоличество - 1 Цикл
		// Получаем строку, начиная с конца
		// Индекс строки для удаления = (ИсходноеКоличество - 1) - Счетчик
		ИндексДляУдаления = (ИсходноеКоличество - 1) - Счетчик;
		ТекущаяСтрока = ДобавленныеКоманды[ИндексДляУдаления];
		
		ИмяКнопки = ТекущаяСтрока.ИмяКнопки;
		// Удаляем команду, связанную с кнопкой, из коллекции команд формы
		// Для этого сначала нужно получить имя команды по имени кнопки
		ИмяКоманды = Элементы[ИмяКнопки].ИмяКоманды;
		Команды.Удалить(Команды[ИмяКоманды]);
		
		// Удаляем кнопку из элементов формы
		Элементы.Удалить( Элементы[ИмяКнопки]);
		
		// Запоминаем имя группы, к которой принадлежала кнопка, для последующего удаления пустой группы
		ИмяГруппыФормы = ТекущаяСтрока.ИмяГруппыФормы;
		// Проверяем, что имя группы заполнено и еще не было добавлено в соответствие
		// Проверка наличия ключа осуществляется с помощью метода Получить()
		Если ЗначениеЗаполнено(ИмяГруппыФормы) И УникальныеИменаГрупп.Получить(ИмяГруппыФормы) = Неопределено Тогда
			УникальныеИменаГрупп.Вставить(ИмяГруппыФормы, Истина); // Значение произвольное
		КонецЕсли;
		
		// Удаляем информацию о кнопке из реквизита формы (таблицы значений)
		// Это нужно делать *до* проверки необходимости удаления группы, чтобы не учитывать её
		ДобавленныеКоманды.Удалить(ТекущаяСтрока);
		
	КонецЦикла;
	
	// После удаления всех кнопок, удаляем пустые группы.
	// Проходимся по списку уникальных имен групп, которые были затронуты.
	Для Каждого КлючИзСоответствия Из УникальныеИменаГрупп Цикл
		ИмяГруппыФормы = КлючИзСоответствия.Ключ;
		
		// Проверяем, остались ли подчинённые элементы у этой группы в элементах формы
		// Получаем сам элемент группы из элементов формы по имени
		ЭлементГруппы = Элементы[ИмяГруппыФормы];
		
		// Убеждаемся, что элемент существует и является группой
		Если ТипЗнч(ЭлементГруппы) = Тип("ГруппаФормы") Тогда
			// Получаем коллекцию 
			//Подчиненные = ЭлементГруппы.ПодчиненныеЭлементы; //Ошибка. попытка переопределить предопределенный элемент
			// Считаем количество подчинённых элементов
			КоличествоПодчиненных = ЭлементГруппы.ПодчиненныеЭлементы.Количество();
			
			// Если подчинённых элементов нет, удаляем группу и связанную с ней команду
			Если КоличествоПодчиненных = 0 Тогда
				// Удаляем команду, связанную с группой
				// Для этого получаем имя команды из элемента группы
				//ИмяКомандыГруппы = ЭлементГруппы.ИмяКоманды;  //Тупой ИИ. Решил, что у группы кнопок должна быть команда
				//Команды.Удалить(ИмяКомандыГруппы);
				
				// Удаляем группу из элементов формы
				Элементы.Удалить(Элементы[ИмяГруппыФормы]);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	// После удаления всех элементов и групп, очищаем таблицу значений
	// (хотя она уже должна быть пустой к этому моменту)
	ДобавленныеКоманды.Очистить();

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКомандыДействия(Команда)
	
	// Получаем информацию о команде из реквизита формы (таблицы значений) по имени нажатой кнопки
	// Для этого сначала получим имя кнопки из параметра
	КодКоманды = Команда.Имя;
	МассивСтрок = ДобавленныеКоманды.НайтиСтроки(Новый Структура("КодКоманды",КодКоманды));
	
	// Проверяем, что информация о команде была найдена
	Для Каждого ОписаниеКоманды Из МассивСтрок Цикл
		
		//Создаю массив карточек основной функциональной роли
		Массив_ФункциональнаяРоль_Основная = Новый Массив;
		Массив_ФункциональнаяРоль_Основная.Добавить(Объект.Ссылка);
		//Делаю полное описание основной функциональной роли
		Отбор_ФункциональнаяРоль_Основная = Новый Структура();
		Отбор_ФункциональнаяРоль_Основная.Вставить("ФункциональнаяРоль",ПредопределенноеЗначение("Справочник._ФункциональныеРоли.ОсновнаяФР"));
		Отбор_ФункциональнаяРоль_Основная.Вставить("Карточки",Массив_ФункциональнаяРоль_Основная);
		Отбор_ФункциональнаяРоль_Основная.Вставить("ПроверятьКакИ",Истина);
		//Подготавливаю масив проверяемых карточек в соответствии с их функциональными ролями	
		Отбор_Карточки = Новый Массив;
		Отбор_Карточки.Добавить(Отбор_ФункциональнаяРоль_Основная);
		Отбор_Команды = Новый Массив;
		Отбор_Команды.Добавить(ОписаниеКоманды.Команда);
		Отбор = Новый Структура("Карточки,ВидКарточки,Команды",Отбор_Карточки,Объект_ВидКарточки(),Отбор_Команды);
	
		// Получаем саму ссылку на объект команды из строки таблицы
		Команда = ОписаниеКоманды.Команда;
		
		_КомандыКлиент.ВыполнитьКоманду(
			ЭтаФорма
			,Отбор
		);

		// Здесь должна быть реализация вызова команды
		// Пока что просто выводим сообщение
		Сообщить("Вызвана команда: " + Команда );
		
	КонецЦикла;
	
	// Также обновляем таблицу реквизитов
	ПриСозданииНаСервере(Ложь, Истина);
	
КонецПроцедуры

&НаСервере
Функция Объект_ВидКарточки()
	Возврат Объект.Ссылка.ВидыКарточки[0].ВидКарточки;
КонецФункции
	

&НаКлиенте
Процедура РеквизитыВидРеквизитаПриИзменении(Элемент)
	ТекущиеДанные = ЭтотОбъект.Элементы.Реквизиты.ТекущиеДанные;
	Если _ВызовСервера.ПолучитьЗначение(ТекущиеДанные.ВидРеквизита,"ЭтоСписок") И НЕ ЗначениеЗаполнено(ТекущиеДанные.УИД_Элемента) Тогда
		ТекущиеДанные.УИД_Элемента = Новый УникальныйИдентификатор;
	КонецЕсли;
КонецПроцедуры




&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
		ТекущийОбъект.ДополнительныеСвойства.Вставить("СохраняемыеРеквизиты",ЭтаФорма.Реквизиты);
КонецПроцедуры


