&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Инициализация реквизита формы для хранения добавленных команд и кнопок
	// Используем ТаблицуЗначений, так как Соответствие не поддерживается в реквизитах формы
	//Если ДобавленныеКоманды = Неопределено Тогда
	//	// Создаем таблицу значений с колонками для хранения информации
	//	ДобавленныеКоманды = Новый ТаблицаЗначений;
	//	ДобавленныеКоманды.Колонки.Добавить("ИмяКнопки");
	//	ДобавленныеКоманды.Колонки.Добавить("КодКоманды");
	//	ДобавленныеКоманды.Колонки.Добавить("Команда"); // Ссылка на элемент справочника _Команды
	//	ДобавленныеКоманды.Колонки.Добавить("Группа");  // Ссылка на элемент справочника _КомандыГруппы
	//	ДобавленныеКоманды.Колонки.Добавить("ИмяГруппыФормы"); // Имя группы на форме, в которой находится кнопка
	//КонецЕсли;
	
	// Заполнение табличной части "Реквизиты" текущими значениями
	Если Объект.ВидыКарточки.Количество()>0 И ЗначениеЗаполнено(Объект.ВидыКарточки[0].ВидКарточки) Тогда
		
		// Создаем отбор для получения текущих значений реквизитов
		Отбор = Новый Соответствие();
		Отбор.Вставить("ВидКарточки", Объект.ВидыКарточки[0].ВидКарточки);
		Отбор.Вставить("Карточка", Объект.Ссылка);
		
		// Получаем текущие значения реквизитов
		Значения = РегистрыСведений._СостояниеКарточек.ПолучитьСостояние(Отбор);
		
		// Очищаем таблицу "Реквизиты" формы
		Реквизиты.Очистить();
		
		// Заполняем таблицу "Реквизиты" полученными значениями
		Для Каждого Эл Из Значения Цикл
			СтрРеквизиты = Реквизиты.Добавить();
			ЗаполнитьЗначенияСвойств(СтрРеквизиты, Эл);
		КонецЦикла;
		
	КонецЕсли;
	
	// Обновляем список доступных команд
	ОбновитьСписокКоманд();
	
КонецПроцедуры


#Область ЗаполнениеСписокаКоманд 
&НаСервере
Процедура ОбновитьСписокКоманд()
		//Процедура расчитана на то что:
		//   команды содержат только одну ФункциональнаяРоль
		//   и карточка имеет только один вид
		//требуется донастройка
		
	// Удаляем ранее добавленные команды и группы
	УдалитьДобавленныеКоманды();
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Возврат; // не нужно заполнять команды для не сохранённой карточки
	КонецЕсли;
	
	//Создаю массив карточек основной функциональной роли
	Массив_ФункциональнаяРоль_Основная = Новый Массив;
	Массив_ФункциональнаяРоль_Основная.Добавить(Объект.Ссылка);
	//Делаю полное описание основной функциональной роли
	Отбор_ФункциональнаяРоль_Основная = Новый Структура();
	Отбор_ФункциональнаяРоль_Основная.Вставить("ФункциональнаяРоль",Справочники._ФункциональныеРоли.ОсновнаяФР);
	Отбор_ФункциональнаяРоль_Основная.Вставить("Карточки",Массив_ФункциональнаяРоль_Основная);
	Отбор_ФункциональнаяРоль_Основная.Вставить("ПроверятьКакИ",Истина);
	//Подготавливаю масив проверяемых карточек в соответствии с их функциональными ролями	

	//Устанавливаю команды без функциональных ролей
	Отбор_Карточки = Новый Массив;
	Отбор_Карточки.Добавить(Отбор_ФункциональнаяРоль_Основная);
	ОтборДляПоискаКоманд = Новый Структура("Карточки,ВидКарточки",Отбор_Карточки,Объект.ВидыКарточки[0].ВидКарточки);
	ОбновитьСписокКомандПоОтбору(ОтборДляПоискаКоманд);

	//+Устанавливаю команды с дополнительной функциональной ролью
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	_Команды.Группа КАК ГруппаКоманд,
		|	_Команды.Ссылка КАК Команда
		|ПОМЕСТИТЬ ВТ_КомандыДоступныеДляВидаКарточки
		|ИЗ
		|	Справочник._ВидыКарточек.ОтображаемыеГруппыКоманд КАК _ВидыКарточекОтображаемыеГруппыКоманд
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник._Команды КАК _Команды
		|		ПО _ВидыКарточекОтображаемыеГруппыКоманд.ГруппыКоманд = _Команды.Группа
		|ГДЕ
		|	_ВидыКарточекОтображаемыеГруппыКоманд.Ссылка = &ВидКарточки
		|	И _Команды.ФункциональныеРоли.ФункциональнаяРоль = ЗНАЧЕНИЕ(Справочник._ФункциональныеРоли.ОсновнаяФР)
		|	И _Команды.ФункциональныеРоли.ВидКарточки = &ВидКарточки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_КомандыДоступныеДляВидаКарточки.Команда КАК Команда,
		|	_ИсточникиФункциональныхРолей.Команда КАК Команда1,
		|	_ИсточникиФункциональныхРолей.ФункциональнаяРоль КАК ФункциональнаяРоль,
		|	_ИсточникиФункциональныхРолей.ВидКарточки КАК ВидКарточки,
		|	_ИсточникиФункциональныхРолей.ВидРеквизита КАК ВидРеквизита,
		|	_ИсточникиФункциональныхРолей.ВидРеквизитаДополнение КАК ВидРеквизитаДополнение
		|ИЗ
		|	ВТ_КомандыДоступныеДляВидаКарточки КАК ВТ_КомандыДоступныеДляВидаКарточки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений._ИсточникиФункциональныхРолей КАК _ИсточникиФункциональныхРолей
		|		ПО (_ИсточникиФункциональныхРолей.ВидКарточки = &ВидКарточки)
		|			И ВТ_КомандыДоступныеДляВидаКарточки.Команда = _ИсточникиФункциональныхРолей.Команда";
	
	Запрос.УстановитьПараметр("ВидКарточки", Объект.ВидыКарточки[0].ВидКарточки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		//Цикл расчитан на то что:
		//   команды содержат только одну ФункциональнаяРоль и
		//   и карточка имеет только один вид
		//требуется донастройка
		ОтборПоискаЗначенияФункциональнойРоли = Новый Структура("ВидРеквизита",Выборка.ВидРеквизита);
		Для каждого ЗначениеФункциональнойРоли ИЗ Этаформа.Реквизиты.НайтиСтроки(ОтборПоискаЗначенияФункциональнойРоли) Цикл
			
			//Создаю массив карточек дополнительной функциональной роли
			Массив_ФункциональнаяРоль_Дополнительная = Новый Массив;
			Массив_ФункциональнаяРоль_Дополнительная.Добавить(ЗначениеФункциональнойРоли.ЗначениеРеквизита);
			//Делаю полное описание дополнительной функциональной роли
			Отбор_ФункциональнаяРоль_Дополнительная = Новый Структура();
			Отбор_ФункциональнаяРоль_Дополнительная.Вставить("ФункциональнаяРоль",Выборка.ФункциональнаяРоль);
			Отбор_ФункциональнаяРоль_Дополнительная.Вставить("Карточки",Массив_ФункциональнаяРоль_Дополнительная);
			Отбор_ФункциональнаяРоль_Дополнительная.Вставить("ПроверятьКакИ",Истина);
			//Подготавливаю масив проверяемых карточек в соответствии с их функциональными ролями	
			Отбор_Карточки = Новый Массив;
			Отбор_Карточки.Добавить(Отбор_ФункциональнаяРоль_Основная);
			Отбор_Карточки.Добавить(Отбор_ФункциональнаяРоль_Дополнительная);
			
			ОтборДляПоискаКоманд = Новый Структура("Карточки,ВидКарточки",Отбор_Карточки,(Объект.Ссылка.ВидыКарточки[0].ВидКарточки));
			
			ОбновитьСписокКомандПоОтбору(ОтборДляПоискаКоманд);
		КонецЦикла;
	КонецЦикла;
	//-Устанавливаю команды с дополнительной функциональной ролью
	
КонецПроцедуры
	
Процедура ОбновитьСписокКомандПоОтбору(_ОтборПоискаДоступныхКоманд_)

	// Получаем список доступных команд
	СписокКоманд = Справочники._Команды.ПолучитьДоступныеКоманды(_ОтборПоискаДоступныхКоманд_);
	
	
	// Соответствие для отслеживания созданных групп команд
	// Ключ - ссылка на группу команды (_КомандыГруппы), Значение - имя группы на форме
	СозданныеГруппы = Новый Соответствие;
	
	// Проходим по списку доступных команд и создаем интерфейс
	Для Каждого ЭлементСписка Из СписокКоманд Цикл
		// Получаем саму ссылку на команду из структуры
		Команда = ЭлементСписка.Команда;
		// Получаем ссылку на группу команды из реквизита Группа справочника _Команды
		ГруппаКомандыСсылка = Команда.Группа;
		
		// Проверяем, что у команды установлена группа
		Если ЗначениеЗаполнено(ГруппаКомандыСсылка) Тогда
			
			// Проверяем, была ли уже создана группа для этой команды
			ИмяГруппыФормы = СозданныеГруппы.Получить(ГруппаКомандыСсылка);
			Если ИмяГруппыФормы = Неопределено Тогда
				
				// Формируем имя группы (подменю) для использования в интерфейсе формы
				// Используем уникальный идентификатор группы, заменив дефисы, чтобы избежать конфликта имен
				ИмяГруппыФормы = "ГруппаКоманд_" + СтрЗаменить(ГруппаКомандыСсылка.УникальныйИдентификатор(), "-", "");
				
				// Добавляем группу (подменю) в элементы формы (на командную панель)
				// Тип элемента - ГруппаФормы, Имя - уникальное, Родитель - заранее созданная группа на форме
				Если ЭтаФорма.ДобавленныеКоманды.НайтиСтроки(Новый Структура("ИмяГруппыФормы",ИмяГруппыФормы)).Количество() = 0 Тогда
					Группакоманд = Элементы.Добавить(ИмяГруппыФормы, Тип("ГруппаФормы"), Элементы.ГруппаКнопокКомандыДействий);
					Группакоманд.Заголовок = ГруппаКомандыСсылка.Наименование;
				Иначе
					Группакоманд = ЭтаФорма.Элементы[ИмяГруппыФормы];
				КонецЕсли;
				// Устанавливаем заголовок группы равным наименованию группы команд
				
				// Сохраняем имя созданной группы в соответствии
				СозданныеГруппы.Вставить(ГруппаКомандыСсылка, ИмяГруппыФормы);
			КонецЕсли;
			
            		
			// Формируем уникальное имя для команды кнопки
			КодКоманды = "Команда_" + СтрЗаменить(Команда.УникальныйИдентификатор(), "-", "") + "_" + СтрЗаменить(ГруппаКомандыСсылка.УникальныйИдентификатор(), "-", "");
			Для каждого ЭлементОтбора_Роль ИЗ _ОтборПоискаДоступныхКоманд_.Карточки Цикл
				Если ЭлементОтбора_Роль.ФункциональнаяРоль = Справочники._ФункциональныеРоли.ОсновнаяФР Тогда
					Продолжить;
				КонецЕсли;
				ОбработаннаяФункциональнаяРоль="невозможноеЗначение";
				Для каждого Роль_Команды ИЗ Команда.ФункциональныеРоли Цикл 
					Если ЭлементОтбора_Роль.ФункциональнаяРоль <> Роль_Команды.ФункциональнаяРоль 
					 ИЛИ ОбработаннаяФункциональнаяРоль = ЭлементОтбора_Роль.ФункциональнаяРоль 
					Тогда
						Продолжить;
					КонецЕсли;
					КодКоманды = КодКоманды+"_" + СтрЗаменить(ЭлементОтбора_Роль.ФункциональнаяРоль.УникальныйИдентификатор(), "-", "");
					Для Каждого ЭлементОтбора_Карточка ИЗ ЭлементОтбора_Роль.Карточки Цикл
						КодКоманды = КодКоманды+"_" + СтрЗаменить(ЭлементОтбора_Карточка.УникальныйИдентификатор(), "-", "");
					КонецЦикла;
					ОбработаннаяФункциональнаяРоль = ЭлементОтбора_Роль.ФункциональнаяРоль;
				КонецЦикла;
			КонецЦикла;
			
			//Запрос поиска правил написан таким образом, что при запросе с функциональными ролями будут возвращаться команды и без функциональных ролей
			//что бы исключить двойное добавление сделана эта проверка
			Если ЭтаФорма.ДобавленныеКоманды.НайтиСтроки(Новый Структура("КодКоманды",КодКоманды)).Количество() = 0 Тогда
				// Добавляем команду для кнопки в коллекцию команд формы
				НоваяКоманда = Команды.Добавить(КодКоманды);
				// Устанавливаем действие команды - вызов процедуры ОбработкаКомандыДействия
				// Это имя процедуры, которая будет выполнена при нажатии кнопки, связанной с командой
				НоваяКоманда.Действие = "ОбработкаКомандыДействия";
				
				// Уникальное имя для кнопки команды
				// Включает в себя часть от имени группы для уникальности
				ИмяКнопки = КодКоманды;
				
				// Добавляем кнопку в элементы формы
				// Тип элемента - КнопкаФормы, Имя - уникальное, Родитель - группа команды
				НоваяКнопка = Элементы.Добавить(ИмяКнопки, Тип("КнопкаФормы"), Группакоманд);
				// Устанавливаем имя команды для кнопки (связь с командой меню)
				НоваяКнопка.ИмяКоманды = КодКоманды;
				// Устанавливаем заголовок кнопки равным наименованию команды
				НоваяКнопка.Заголовок = Команда.Наименование;
				
				// Сохраняем информацию о добавленной кнопке и связанной с ней команде в Таблице Значений
				НоваяСтрока = ДобавленныеКоманды.Добавить();
				НоваяСтрока.ИмяКнопки = ИмяКнопки;
				НоваяСтрока.КодКоманды=КодКоманды;
				НоваяСтрока.Команда = Команда;
				НоваяСтрока.Группа = ГруппаКомандыСсылка;
				НоваяСтрока.ИмяГруппыФормы = ИмяГруппыФормы;
				НоваяСтрока.ОтборПоискаДоступныхКоманд = _ОтборПоискаДоступныхКоманд_;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьДобавленныеКоманды()
	
	// Для корректного удаления пустых групп после кнопок,
	// запоминаем имена всех динамически добавленных групп.
	// Создадим соответствие для хранения уникальных имен групп.
	УникальныеИменаГрупп = Новый Соответствие;
	
	// Проходим по всем ранее добавленным командам и удаляем соответствующие элементы интерфейса
	// Используем итерацию с конца, чтобы избежать проблем с изменением исходной таблицы во время итерации
	
	// Получаем исходное количество строк
	ИсходноеКоличество = ДобавленныеКоманды.Количество();
	
	// Итерируемся от последней строки к первой (от большего индекса к меньшему)
	// Индексация строк в ТаблицеЗначений начинается с 0
	Для Счетчик = 0 По ИсходноеКоличество - 1 Цикл
		// Получаем строку, начиная с конца
		// Индекс строки для удаления = (ИсходноеКоличество - 1) - Счетчик
		ИндексДляУдаления = (ИсходноеКоличество - 1) - Счетчик;
		ТекущаяСтрока = ДобавленныеКоманды[ИндексДляУдаления];
		
		ИмяКнопки = ТекущаяСтрока.ИмяКнопки;
		// Удаляем команду, связанную с кнопкой, из коллекции команд формы
		// Для этого сначала нужно получить имя команды по имени кнопки
		ИмяКоманды = Элементы[ИмяКнопки].ИмяКоманды;
		Команды.Удалить(Команды[ИмяКоманды]);
		
		// Удаляем кнопку из элементов формы
		Элементы.Удалить( Элементы[ИмяКнопки]);
		
		// Запоминаем имя группы, к которой принадлежала кнопка, для последующего удаления пустой группы
		ИмяГруппыФормы = ТекущаяСтрока.ИмяГруппыФормы;
		// Проверяем, что имя группы заполнено и еще не было добавлено в соответствие
		// Проверка наличия ключа осуществляется с помощью метода Получить()
		Если ЗначениеЗаполнено(ИмяГруппыФормы) И УникальныеИменаГрупп.Получить(ИмяГруппыФормы) = Неопределено Тогда
			УникальныеИменаГрупп.Вставить(ИмяГруппыФормы, Истина); // Значение произвольное
		КонецЕсли;
		
		// Удаляем информацию о кнопке из реквизита формы (таблицы значений)
		// Это нужно делать *до* проверки необходимости удаления группы, чтобы не учитывать её
		ДобавленныеКоманды.Удалить(ТекущаяСтрока);
		
	КонецЦикла;
	
	// После удаления всех кнопок, удаляем пустые группы.
	// Проходимся по списку уникальных имен групп, которые были затронуты.
	Для Каждого КлючИзСоответствия Из УникальныеИменаГрупп Цикл
		ИмяГруппыФормы = КлючИзСоответствия.Ключ;
		
		// Проверяем, остались ли подчинённые элементы у этой группы в элементах формы
		// Получаем сам элемент группы из элементов формы по имени
		ЭлементГруппы = Элементы[ИмяГруппыФормы];
		
		// Убеждаемся, что элемент существует и является группой
		Если ТипЗнч(ЭлементГруппы) = Тип("ГруппаФормы") Тогда
			// Получаем коллекцию 
			//Подчиненные = ЭлементГруппы.ПодчиненныеЭлементы; //Ошибка. попытка переопределить предопределенный элемент
			// Считаем количество подчинённых элементов
			КоличествоПодчиненных = ЭлементГруппы.ПодчиненныеЭлементы.Количество();
			
			// Если подчинённых элементов нет, удаляем группу и связанную с ней команду
			Если КоличествоПодчиненных = 0 Тогда
				// Удаляем команду, связанную с группой
				// Для этого получаем имя команды из элемента группы
				//ИмяКомандыГруппы = ЭлементГруппы.ИмяКоманды;  //Тупой ИИ. Решил, что у группы кнопок должна быть команда
				//Команды.Удалить(ИмяКомандыГруппы);
				
				// Удаляем группу из элементов формы
				Элементы.Удалить(Элементы[ИмяГруппыФормы]);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	// После удаления всех элементов и групп, очищаем таблицу значений
	// (хотя она уже должна быть пустой к этому моменту)
	ДобавленныеКоманды.Очистить();

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКомандыДействия(Команда)
	
	// Получаем информацию о команде из реквизита формы (таблицы значений) по имени нажатой кнопки
	// Для этого сначала получим имя кнопки из параметра
	КодКоманды = Команда.Имя;
	МассивСтрок = ДобавленныеКоманды.НайтиСтроки(Новый Структура("КодКоманды",КодКоманды));
	
	// Проверяем, что информация о команде была найдена
	Для Каждого ОписаниеКоманды Из МассивСтрок Цикл
		
		////Создаю массив карточек основной функциональной роли
		//Массив_ФункциональнаяРоль_Основная = Новый Массив;
		//Массив_ФункциональнаяРоль_Основная.Добавить(Объект.Ссылка);
		////Делаю полное описание основной функциональной роли
		//Отбор_ФункциональнаяРоль_Основная = Новый Структура();
		//Отбор_ФункциональнаяРоль_Основная.Вставить("ФункциональнаяРоль",ПредопределенноеЗначение("Справочник._ФункциональныеРоли.ОсновнаяФР"));
		//Отбор_ФункциональнаяРоль_Основная.Вставить("Карточки",Массив_ФункциональнаяРоль_Основная);
		//Отбор_ФункциональнаяРоль_Основная.Вставить("ПроверятьКакИ",Истина);
		////Подготавливаю масив проверяемых карточек в соответствии с их функциональными ролями	
		//Отбор_Карточки = Новый Массив;
		//Отбор_Карточки.Добавить(Отбор_ФункциональнаяРоль_Основная);

		//Отбор = Новый Структура("Карточки,ВидКарточки,Команды",Отбор_Карточки,Объект_ВидКарточки(),Отбор_Команды);
		
		
		Массив_Команды = Новый Массив;
		Массив_Команды.Добавить(ОписаниеКоманды.Команда);
		ОтборПоискаКоманды = ОписаниеКоманды.ОтборПоискаДоступныхКоманд;
		ОтборПоискаКоманды.Вставить("Команды",Массив_Команды);
	
		_КомандыКлиент.ВыполнитьКоманду(ЭтаФорма,ОтборПоискаКоманды);

		// Здесь должна быть реализация вызова команды
		// Пока что просто выводим сообщение
		Сообщить("Вызвана команда: " + Команда );
		
		Прервать;
	КонецЦикла;
	
	// Также обновляем таблицу реквизитов
	ПриСозданииНаСервере(Ложь, Истина);
	
КонецПроцедуры

&НаСервере
Функция Объект_ВидКарточки()
	Возврат Объект.Ссылка.ВидыКарточки[0].ВидКарточки;
КонецФункции

#КонецОбласти 

&НаКлиенте
Процедура РеквизитыВидРеквизитаПриИзменении(Элемент)
	ТекущиеДанные = ЭтотОбъект.Элементы.Реквизиты.ТекущиеДанные;
	Если _ВызовСервера.ПолучитьЗначение(ТекущиеДанные.ВидРеквизита,"ЭтоСписок") И НЕ ЗначениеЗаполнено(ТекущиеДанные.УИД_Элемента) Тогда
		ТекущиеДанные.УИД_Элемента = Новый УникальныйИдентификатор;
	КонецЕсли;
КонецПроцедуры




&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
		ТекущийОбъект.ДополнительныеСвойства.Вставить("СохраняемыеРеквизиты",ЭтаФорма.Реквизиты);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	//Объект.ВидКарточки_Представление ="";
	//Для каждого стрВидКарточки Из Объект.ВидыКарточки Цикл
	//	Объект.ВидКарточки_Представление = Объект.ВидКарточки_Представление+" ;"+стрВидКарточки.ВидКарточки;	
	//КонецЦикла;
	//Объект.ВидКарточки_Представление = Сред(Объект.ВидКарточки_Представление,2);
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если Копирование И НоваяСтрока Тогда
		Элемент.ТекущиеДанные.УИД_Элемента = Новый УникальныйИдентификатор;
	КонецЕсли;
	// Вставить содержимое обработчика.
КонецПроцедуры


